{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\Dropbox\curso_stata\jianton.github.io\stata5.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Aug 2019, 08:44:25
{txt}
{com}. //_1
. //  Fijamos el directorio de trabajo
. 
. cd "D:\Dropbox\curso_stata\sesión5"
{res}D:\Dropbox\curso_stata\sesión5
{txt}
{com}. 
. //  Instalamos el paquete estout
. 
. ssc install estout, replace
{txt}checking {hilite:estout} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. //  Abrimos el archivo
. 
. use "ecv18t.dta", clear
{txt}(ECV 2018 (mercado de trabajo))

{com}. 
. //  Creamos las variables necesarias
. 
. generate edad2 = edad^2
{txt}
{com}. label variable edad2 "Edad al cuadrado"
{txt}
{com}. 
. //  Realizamos las regresiones
. 
. eststo total: regress logsalario ib1.sexo edad edad2 ib1.educg

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    11,599
{txt}{hline 13}{c +}{hline 34}   F(5, 11593)     = {res}   577.13
{txt}       Model {c |} {res} 1600.34458         5  320.068916   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6429.36841    11,593  .554590565   {txt}R-squared       ={res}    0.1993
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1990
{txt}       Total {c |} {res}   8029.713    11,598  .692336006   {txt}Root MSE        =   {res} .74471

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  logsalario{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}sexo {c |}
{space 6}Mujer  {c |}{col 14}{res}{space 2}-.2365705{col 26}{space 2}   .01394{col 37}{space 1}  -16.97{col 46}{space 3}0.000{col 54}{space 4}-.2638953{col 67}{space 3}-.2092458
{txt}{space 8}edad {c |}{col 14}{res}{space 2} .0721823{col 26}{space 2} .0046198{col 37}{space 1}   15.62{col 46}{space 3}0.000{col 54}{space 4} .0631268{col 67}{space 3} .0812378
{txt}{space 7}edad2 {c |}{col 14}{res}{space 2}-.0005808{col 26}{space 2} .0000535{col 37}{space 1}  -10.86{col 46}{space 3}0.000{col 54}{space 4}-.0006856{col 67}{space 3}-.0004759
{txt}{space 12} {c |}
{space 7}educg {c |}
Nivel medio  {c |}{col 14}{res}{space 2}  .240602{col 26}{space 2} .0185962{col 37}{space 1}   12.94{col 46}{space 3}0.000{col 54}{space 4} .2041503{col 67}{space 3} .2770537
{txt}{space 1}Nivel alto  {c |}{col 14}{res}{space 2}  .613554{col 26}{space 2} .0163944{col 37}{space 1}   37.42{col 46}{space 3}0.000{col 54}{space 4} .5814181{col 67}{space 3} .6456898
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.145524{col 26}{space 2} .0958254{col 37}{space 1}   53.70{col 46}{space 3}0.000{col 54}{space 4}  4.95769{col 67}{space 3} 5.333357
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo male: regress logsalario edad edad2 ib1.educg if sexo == 1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     5,966
{txt}{hline 13}{c +}{hline 34}   F(4, 5961)      = {res}   386.62
{txt}       Model {c |} {res} 833.616132         4  208.404033   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3213.21346     5,961  .539039333   {txt}R-squared       ={res}    0.2060
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2055
{txt}       Total {c |} {res}  4046.8296     5,965  .678429102   {txt}Root MSE        =   {res} .73419

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  logsalario{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}edad {c |}{col 14}{res}{space 2} .0758506{col 26}{space 2} .0061639{col 37}{space 1}   12.31{col 46}{space 3}0.000{col 54}{space 4} .0637672{col 67}{space 3}  .087934
{txt}{space 7}edad2 {c |}{col 14}{res}{space 2}-.0005995{col 26}{space 2} .0000715{col 37}{space 1}   -8.38{col 46}{space 3}0.000{col 54}{space 4}-.0007397{col 67}{space 3}-.0004593
{txt}{space 12} {c |}
{space 7}educg {c |}
Nivel medio  {c |}{col 14}{res}{space 2} .2544457{col 26}{space 2} .0246757{col 37}{space 1}   10.31{col 46}{space 3}0.000{col 54}{space 4} .2060723{col 67}{space 3} .3028191
{txt}{space 1}Nivel alto  {c |}{col 14}{res}{space 2} .5653884{col 26}{space 2} .0220473{col 37}{space 1}   25.64{col 46}{space 3}0.000{col 54}{space 4} .5221677{col 67}{space 3} .6086091
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.037839{col 26}{space 2}  .127506{col 37}{space 1}   39.51{col 46}{space 3}0.000{col 54}{space 4} 4.787881{col 67}{space 3} 5.287797
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo female: regress logsalario edad edad2 ib1.educg if sexo == 2

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     5,633
{txt}{hline 13}{c +}{hline 34}   F(4, 5628)      = {res}   309.16
{txt}       Model {c |} {res} 703.432328         4  175.858082   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3201.40011     5,628   .56883442   {txt}R-squared       ={res}    0.1801
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1796
{txt}       Total {c |} {res} 3904.83244     5,632  .693329624   {txt}Root MSE        =   {res} .75421

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  logsalario{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}edad {c |}{col 14}{res}{space 2} .0665724{col 26}{space 2}   .00695{col 37}{space 1}    9.58{col 46}{space 3}0.000{col 54}{space 4} .0529477{col 67}{space 3}  .080197
{txt}{space 7}edad2 {c |}{col 14}{res}{space 2}-.0005401{col 26}{space 2} .0000803{col 37}{space 1}   -6.73{col 46}{space 3}0.000{col 54}{space 4}-.0006974{col 67}{space 3}-.0003827
{txt}{space 12} {c |}
{space 7}educg {c |}
Nivel medio  {c |}{col 14}{res}{space 2} .2314164{col 26}{space 2} .0282288{col 37}{space 1}    8.20{col 46}{space 3}0.000{col 54}{space 4}  .176077{col 67}{space 3} .2867557
{txt}{space 1}Nivel alto  {c |}{col 14}{res}{space 2} .6600433{col 26}{space 2} .0245986{col 37}{space 1}   26.83{col 46}{space 3}0.000{col 54}{space 4} .6118206{col 67}{space 3} .7082661
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  5.05201{col 26}{space 2} .1443795{col 37}{space 1}   34.99{col 46}{space 3}0.000{col 54}{space 4} 4.768971{col 67}{space 3}  5.33505
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab total male female using "salarios1.rtf", replace
{res}{txt}(output written to {browse  `"salarios1.rtf"'})

{com}. //_2
. esttab total male female using "salarios2aux.rtf", ///
> b(%04,3fc) se(%04,3fc) /// Presentar coeficientes y errores estándar (con formato)
> varlabels(2.sexo "Mujer" edad "Edad" edad2 "Edad{c -(}\super {c )-}" 2.educg "Educación media" 3.educg "Educación superior") /// Etiquetas
> stats(N r2_a, fmt(%6,0fc %04,3fc) labels("No. de observaciones" "R{c -(}\super 2{c )-} ajustado")) ///
> nobaselevels /// No mostrar las categorías de referencia
> noconstant /// No mostrar la constante
> varwidth(20) /// Anchura de la columna de la variable
> fonttbl(\f0\fnil Times New Roman;\f1\fnil Times New Roman;) /// Tamaño de la fuente
> title({c -(}\b Tabla 1.{c )-} {c -(}Regresión salarial por sexo{c )-}) /// Título de la tabla
> nonumbers mtitles("Total" " Hombres" "Mujeres") /// Títulos de las columnas
> addnote("Todos los modelos incluyen una constante." "Fuente: Elaboración propia a partir de la ECV 2018.") /// Añadir un pie a la tabla
> replace
{res}{txt}(output written to {browse  `"salarios2aux.rtf"'})

{com}. 
. unicode convertfile "salarios2aux.rtf" "salarios2.rtf", dstencoding(ISO-8859-1) replace // Posibilidad de utilizar caracteres que no son unicode
{res}{txt}{p 0 6 2}
note: file {bf:"salarios2aux.rtf"} converted to file {bf:"salarios2.rtf"}

{com}. erase "salarios2aux.rtf" // Borramos el archivo auxiliar creado
{txt}
{com}. //_3q
. quietly{c -(}
{txt}
{com}. //_4
. //    Establecemos la coma como decimal
. 
. set dp comma
{txt}
{com}. 
. //    Realizamos las regresiones
. 
. eststo total: quietly: regress logsalario sexodummy2 edad edad2 educdummy2 educdummy3
{txt}
{com}. eststo male: quietly: regress logsalario edad edad2 educdummy2 educdummy3 if sexo == 1
{txt}
{com}. eststo female: quietly: regress logsalario edad edad2 educdummy2 educdummy3 if sexo == 2
{txt}
{com}. 
. //  Exportamos la tabla
. 
. estout total male female using "tabla1.tex", replace style(tex) ///
>   keep(sexodummy2 edad edad2 educdummy2 educdummy3) ///
>   varlabels(sexodummy2 "Mujer" edad "Edad" edad2 "Edad\textsuperscript{c -(}2{c )-}" educdummy2 "Educación media" educdummy3 "Educación superior") ///
>   cells(b(fmt(3) star) se(par fmt(3))) ///
> starlevels("\sym{c -(}*{c )-}" 0.10 "\sym{c -(}**{c )-}" 0.05 "\sym{c -(}***{c )-}" 0.01) ///
>   stats(N r2_a, fmt(%6,0fc %04,3fc) labels("No. de observaciones" "R\textsuperscript{c -(}2{c )-} ajustado")) ///
>   prefoot("[2ex]") ///
>   mlabel(, none) collabels(none)
{res}{txt}(output written to {browse  `"tabla1.tex"'})

{com}. //_5
. //    Creamos algunas macros con estadísticos descriptivos
. 
. summarize salario if sexo == 1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}salario {c |}{res}      6.036    2163,165    1926,792          0    46507,3
{txt}
{com}. local salh: display %04.0fc r(mean)
{res}{txt}
{com}. summarize salario if sexo == 2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}salario {c |}{res}      5.708    1830,543    1657,196          0      62207
{txt}
{com}. local salm: display %04.0fc r(mean)
{res}{txt}
{com}. 
. //    Exportamos un texto que contiene las macros
. 
. texdoc init "texto.tex", replace force
{res}{txt}(texdoc output file is texto.tex)
{res}{txt}
{com}. tex El salario medio de los hombres es \num{c -(}`salh'{c )-} euros mensuales y el de las mujeres, \num{c -(}`salm'{c )-}.
{res}{txt}
{com}. texdoc close
{txt}(texdoc output written to {browse `"D:\Dropbox\curso_stata\sesión5\texto.tex"':texto.tex})
{res}{txt}
{com}. 
. //_6
. //  Configuramos el gráfico
. 
. grstyle clear
{txt}
{com}. grstyle init
{res}{txt}
{com}. grstyle set plain
{txt}
{com}. grstyle color background white
{txt}
{com}. grstyle graphsize x 4
{txt}
{com}. grstyle graphsize y 4
{txt}
{com}. grstyle set nogrid
{txt}
{com}. grstyle set color hue, n(4)
{res}{txt}
{com}. grstyle linestyle legend none
{txt}
{com}. grstyle set legend 6
{txt}
{com}. grstyle set color red green orange blue
{res}{txt}
{com}. 
. //  Elaboramos el gráfico
. 
. twoway ///
> (kdensity logsalario if sexo == 1 [aweight = peso]) ///
> (kdensity logsalario if sexo == 2 [aweight = peso]), ///
> ytitle("Densidad", size(vsmall) margin(sides)) ylabel(, labsize(vsmall) format(%02,1fc)) ///
> xtitle("Salario bruto en logaritmos (euros/mes)", size(vsmall) margin(top_bottom)) xlabel(, labsize(vsmall)) ///
> legend(on order(1 "Hombres" 2 "Mujeres") cols(1) size(vsmall) position(10) ring(0))
{res}{txt}
{com}. 
. // Exportamos el gráfico
. 
. graph export "figura1.pdf", as(pdf) replace
{txt}(file figura1.pdf written in PDF format)

{com}. //_7q
. quietly{c -(}
{txt}
{com}. //_8q
. quietly: cd "D:\Dropbox\curso_stata\jianton.github.io"
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\Dropbox\curso_stata\jianton.github.io\stata5.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Aug 2019, 08:44:25
{txt}{.-}
{smcl}
{txt}{sf}{ul off}