{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\Dropbox\curso_stata\jianton.github.io\stata2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Jun 2025, 22:33:43
{txt}
{com}. //_1
. cd "D:\Dropbox\curso_stata\sesión2"
{res}D:\Dropbox\curso_stata\sesión2
{txt}
{com}. //_2
. //  Abrimos la base de datos
. 
. use "ecv18d.dta", clear
{txt}(ECV 2018-archivo D)

{com}. 
. //  Realizamos la fusión
. 
. merge 1:1 hid using "ecv18h.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          13,368{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. //  Comprobamos que se ha realizado correctamente
. 
. tabulate _merge

   {txt}Matching result from {c |}
                  merge {c |}      Freq.     Percent        Cum.
{hline 24}{c +}{hline 35}
            Matched (3) {c |}{res}     13,368      100.00      100.00
{txt}{hline 24}{c +}{hline 35}
                  Total {c |}{res}     13,368      100.00
{txt}
{com}. //_3
. //  Abrimos la base de datos
. 
. use "ecv18r.dta", clear
{txt}(ECV 2018-archivo R)

{com}. 
. //  Realizamos la fusión
. 
. merge 1:1 pid using "ecv18p.dta"
{res}{txt}(label {bf:{txt}anonac_lab} already defined)
(label {bf:{txt}sexo_lab} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           5,362
{txt}{col 9}from master{col 30}{res}           5,362{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          28,372{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. //  Comprobamos que se ha realizado correctamente
. 
. tabulate _merge

   {txt}Matching result from {c |}
                  merge {c |}      Freq.     Percent        Cum.
{hline 24}{c +}{hline 35}
        Master only (1) {c |}{res}      5,362       15.89       15.89
{txt}            Matched (3) {c |}{res}     28,372       84.11      100.00
{txt}{hline 24}{c +}{hline 35}
                  Total {c |}{res}     33,734      100.00
{txt}
{com}. //_4
. //  Abrimos la base de datos
. 
. use "ecv18r.dta", clear
{txt}(ECV 2018-archivo R)

{com}. 
. //  Realizamos la fusión
. 
. merge m:1 hid using "ecv18d.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          33,734{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. //  Comprobamos que se ha realizado correctamente
. 
. tabulate _merge

   {txt}Matching result from {c |}
                  merge {c |}      Freq.     Percent        Cum.
{hline 24}{c +}{hline 35}
            Matched (3) {c |}{res}     33,734      100.00      100.00
{txt}{hline 24}{c +}{hline 35}
                  Total {c |}{res}     33,734      100.00
{txt}
{com}. //_5
. //  Fusionamos los archivos de personas
. 
. use "ecv18r.dta", clear
{txt}(ECV 2018-archivo R)

{com}. merge 1:1 pid using "ecv18p.dta", nogenerate
{res}{txt}(label {bf:{txt}anonac_lab} already defined)
(label {bf:{txt}sexo_lab} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           5,362
{txt}{col 9}from master{col 30}{res}           5,362{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}          28,372{txt}  
{col 5}{hline 41}

{com}. 
. //  Fusionamos con los archivos de hogares
. 
. merge m:1 hid using "ecv18d.dta", nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          33,734{txt}  
{col 5}{hline 41}

{com}. merge m:1 hid using "ecv18h.dta", nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          33,734{txt}  
{col 5}{hline 41}

{com}. //_6
. //  Abrimos el archivo de la ECV de 2016
. 
. use "ecv16.dta", clear
{txt}(ECV 2016)

{com}. 
. //  Agregamos los años 2017 y 2018
. 
. append using "ecv17.dta" "ecv18.dta"
{txt}(label {bf:{txt}anonac_lab} already defined)
(label {bf:{txt}sexo_lab} already defined)
(label {bf:{txt}sithogar_lab} already defined)
(label {bf:{txt}sitact_lab} already defined)
(label {bf:{txt}hbajosalario_lab} already defined)
(label {bf:{txt}ecivil_lab} already defined)
(label {bf:{txt}phecho_lab} already defined)
(label {bf:{txt}paisnac_lab} already defined)
(label {bf:{txt}nacionalidad_lab} already defined)
(label {bf:{txt}cursaeduc} already defined)
(label {bf:{txt}nivelcursa_lab} already defined)
(label {bf:{txt}educ_lab} already defined)
(label {bf:{txt}htrabajo_lab} already defined)
(label {bf:{txt}busctrabajo_lab} already defined)
(label {bf:{txt}disptrabajo_lab} already defined)
(label {bf:{txt}sitprof_lab} already defined)
(label {bf:{txt}menos30h_lab} already defined)
(label {bf:{txt}ntrabajadores_lab} already defined)
(label {bf:{txt}contrato_lab} already defined)
(label {bf:{txt}supervisor_lab} already defined)
(label {bf:{txt}cambiotrabajo_lab} already defined)
(label {bf:{txt}motivocambio_lab} already defined)
(label {bf:{txt}cambioact_lab} already defined)
(label {bf:{txt}act_lab} already defined)
(label {bf:{txt}salud_lab} already defined)
(label {bf:{txt}cronico_lab} already defined)
(label {bf:{txt}limitacion_lab} already defined)
(label {bf:{txt}consulta_lab} already defined)
(label {bf:{txt}motconsulta_lab} already defined)
(label {bf:{txt}consultadentista_lab} already defined)
(label {bf:{txt}motdentista_lab} already defined)
(label {bf:{txt}ayulimit_lab} already defined)
(label {bf:{txt}privacion_lab} already defined)
(label {bf:{txt}region_lab} already defined)
(label {bf:{txt}urb_lab} already defined)
(label {bf:{txt}hrethip_lab} already defined)
(label {bf:{txt}hretfact_lab} already defined)
(label {bf:{txt}hvaca_lab} already defined)
(label {bf:{txt}hcomida} already defined)
(label {bf:{txt}hgastos_lab} already defined)
(label {bf:{txt}htelef_lab} already defined)
(label {bf:{txt}hpc_lab} already defined)
(label {bf:{txt}hlavadora_lab} already defined)
(label {bf:{txt}hcoche_lab} already defined)
(label {bf:{txt}hcapacidad_lab} already defined)
(label {bf:{txt}hcargagastos_lab} already defined)
(label {bf:{txt}hcargaprest_lab} already defined)
(label {bf:{txt}hluz_lab} already defined)
(label {bf:{txt}hruidos_lab} already defined)
(label {bf:{txt}hcontam_lab} already defined)
(label {bf:{txt}hdelin_lab} already defined)
(label {bf:{txt}hvivienda_lab} already defined)
(label {bf:{txt}htenencia_lab} already defined)
(label {bf:{txt}hnhabit_lab} already defined)
(label {bf:{txt}hprobl_lab} already defined)
(label {bf:{txt}htemp_lab} already defined)
(label {bf:{txt}hducha_lab} already defined)
(label {bf:{txt}hinodoro_lab} already defined)
(label {bf:{txt}hayuamigos_lab} already defined)
(label {bf:{txt}hayuorg_lab} already defined)
(label {bf:{txt}htipohogar_lab} already defined)
(label {bf:{txt}hpobreza_lab} already defined)
(label {bf:{txt}hmuebles_lab} already defined)
(label {bf:{txt}hmuebles_lab} already defined)
(label {bf:{txt}hpobreza_lab} already defined)
(label {bf:{txt}htipohogar_lab} already defined)
(label {bf:{txt}hayuorg_lab} already defined)
(label {bf:{txt}hayuamigos_lab} already defined)
(label {bf:{txt}hinodoro_lab} already defined)
(label {bf:{txt}hducha_lab} already defined)
(label {bf:{txt}htemp_lab} already defined)
(label {bf:{txt}hprobl_lab} already defined)
(label {bf:{txt}hnhabit_lab} already defined)
(label {bf:{txt}htenencia_lab} already defined)
(label {bf:{txt}hvivienda_lab} already defined)
(label {bf:{txt}hdelin_lab} already defined)
(label {bf:{txt}hcontam_lab} already defined)
(label {bf:{txt}hruidos_lab} already defined)
(label {bf:{txt}hluz_lab} already defined)
(label {bf:{txt}hcargaprest_lab} already defined)
(label {bf:{txt}hcargagastos_lab} already defined)
(label {bf:{txt}hcapacidad_lab} already defined)
(label {bf:{txt}hcoche_lab} already defined)
(label {bf:{txt}hlavadora_lab} already defined)
(label {bf:{txt}hpc_lab} already defined)
(label {bf:{txt}htelef_lab} already defined)
(label {bf:{txt}hgastos_lab} already defined)
(label {bf:{txt}hcomida} already defined)
(label {bf:{txt}hvaca_lab} already defined)
(label {bf:{txt}hretfact_lab} already defined)
(label {bf:{txt}hrethip_lab} already defined)
(label {bf:{txt}urb_lab} already defined)
(label {bf:{txt}region_lab} already defined)
(label {bf:{txt}privacion_lab} already defined)
(label {bf:{txt}ayulimit_lab} already defined)
(label {bf:{txt}motdentista_lab} already defined)
(label {bf:{txt}consultadentista_lab} already defined)
(label {bf:{txt}motconsulta_lab} already defined)
(label {bf:{txt}consulta_lab} already defined)
(label {bf:{txt}limitacion_lab} already defined)
(label {bf:{txt}cronico_lab} already defined)
(label {bf:{txt}salud_lab} already defined)
(label {bf:{txt}act_lab} already defined)
(label {bf:{txt}cambioact_lab} already defined)
(label {bf:{txt}motivocambio_lab} already defined)
(label {bf:{txt}cambiotrabajo_lab} already defined)
(label {bf:{txt}supervisor_lab} already defined)
(label {bf:{txt}contrato_lab} already defined)
(label {bf:{txt}ntrabajadores_lab} already defined)
(label {bf:{txt}menos30h_lab} already defined)
(label {bf:{txt}sitprof_lab} already defined)
(label {bf:{txt}disptrabajo_lab} already defined)
(label {bf:{txt}busctrabajo_lab} already defined)
(label {bf:{txt}htrabajo_lab} already defined)
(label {bf:{txt}educ_lab} already defined)
(label {bf:{txt}nivelcursa_lab} already defined)
(label {bf:{txt}cursaeduc} already defined)
(label {bf:{txt}nacionalidad_lab} already defined)
(label {bf:{txt}paisnac_lab} already defined)
(label {bf:{txt}phecho_lab} already defined)
(label {bf:{txt}ecivil_lab} already defined)
(label {bf:{txt}hbajosalario_lab} already defined)
(label {bf:{txt}sitact_lab} already defined)
(label {bf:{txt}sithogar_lab} already defined)
(label {bf:{txt}sexo_lab} already defined)
(label {bf:{txt}anonac_lab} already defined)

{com}. 
. //  Podemos comprobar cómo tenemos información de los tres años
. 
. tabulate ano

  {txt}Año de la {c |}
   encuesta {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       2016 {c |}{res}     36,380       34.64       34.64
{txt}       2017 {c |}{res}     34,911       33.24       67.88
{txt}       2018 {c |}{res}     33,734       32.12      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    105,025      100.00
{txt}
{com}. //_7
. //  Seleccionamos los trabajadores asalariados únicamente
. 
. generate rentaasa = rentamonasag + rentanomonasag
{txt}(16,671 missing values generated)

{com}. generate nmesesasa = nmesesasatc + 0.5*nmesesasatp
{txt}(17,397 missing values generated)

{com}. keep if rentaasa > 0 & rentaasa < .
{txt}(61,114 observations deleted)

{com}. keep if nmesesasa > 0 & nmesesasa < .
{txt}(8,361 observations deleted)

{com}. 
. //  Creamos el salario bruto mensual de los trabajadores
. 
. generate salario = rentaasa/nmesesasa
{txt}
{com}. label variable salario "Salario bruto mensual"
{txt}
{com}. 
. //  Generamos una base de datos con el salario medio por Comunidad Autónoma y año
. 
. collapse (mean) salariomed = salario, by(ano sexo)
{res}{txt}
{com}. //_8
. sort sexo ano
{txt}
{com}. list sexo ano salariomed
{txt}
     {c TLC}{hline 8}{c -}{hline 6}{c -}{hline 10}{c TRC}
     {c |} {res}  sexo    ano   salari~d {txt}{c |}
     {c LT}{hline 8}{c -}{hline 6}{c -}{hline 10}{c RT}
  1. {c |} {res}Hombre   2016    2285.98 {txt}{c |}
  2. {c |} {res}Hombre   2017   2200.433 {txt}{c |}
  3. {c |} {res}Hombre   2018   2198.547 {txt}{c |}
  4. {c |} {res} Mujer   2016   1877.008 {txt}{c |}
  5. {c |} {res} Mujer   2017   1833.733 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 6}{c -}{hline 10}{c RT}
  6. {c |} {res} Mujer   2018   1854.421 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 6}{c -}{hline 10}{c BRC}

{com}. //_9
. //  Cambiamos la disposición de long a wide
. 
. reshape wide salariomed, i(sexo) j(ano)
{txt}(j = 2016 2017 2018)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}           6   {txt}->   {res}2           
{txt}Number of variables        {res}           3   {txt}->   {res}4           
{txt}j variable (3 values)               {res}ano   {txt}->   (dropped)
xij variables:
                             {res}salariomed   {txt}->   {res}salariomed2016 salariomed2017 salariomed2018
{txt}{hline 77}

{com}. 
. //  Calculamos el crecimiento del salario de 2016 a 2018
. 
. generate cambio1618 = 100*(salariomed2018 - salariomed2016)/salariomed2016
{txt}
{com}. label var cambio1618 "Cambio porcentual del salario (2016-2018)"
{txt}
{com}. 
. //  Podemos ver cómo se ha creado la nueva variable
. 
. list sexo salariomed2016 salariomed2018 cambio1618
{txt}
     {c TLC}{hline 8}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c TRC}
     {c |} {res}  sexo   sal~2016   sal~2018   camb~1618 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
  1. {c |} {res}Hombre    2285.98   2198.547   -3.824764 {txt}{c |}
  2. {c |} {res} Mujer   1877.008   1854.421   -1.203314 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c BRC}

{com}. //_10
. //  Cambiamos la disposición de long a wide
. 
. reshape long salariomed, i(sexo) j(ano)
{txt}(j = 2016 2017 2018)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}           2   {txt}->   {res}6           
{txt}Number of variables        {res}           5   {txt}->   {res}4           
{txt}j variable (3 values)                     ->   {res}ano
{txt}xij variables:
{res}salariomed2016 salariomed2017 salariomed2018{txt}-> {res}salariomed
{txt}{hline 77}

{com}. //_11
. describe

{txt}Contains data
 Observations:{res}             6                  ECV 2016
{txt}    Variables:{res}             4                  
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:sexo           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:sexo_lab }{bind:  }{res}{res}Sexo{p_end}
{p 0 48}{bind:ano            }{txt}{bind: int     }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Año de la encuesta{p_end}
{p 0 48}{bind:salariomed     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}(mean) salario{p_end}
{p 0 48}{bind:cambio1618     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Cambio porcentual del salario (2016-2018){p_end}
{txt}{hline}
Sorted by: {res}sexo  ano
{txt}     Note: {res}Dataset has changed since last saved.
{txt}
{com}. 
. preserve
{txt}
{com}. 
. //  Eliminamos la variable sexo
. 
. drop sexo
{txt}
{com}. 
. describe

{txt}Contains data
 Observations:{res}             6                  ECV 2016
{txt}    Variables:{res}             3                  
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:ano            }{txt}{bind: int     }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Año de la encuesta{p_end}
{p 0 48}{bind:salariomed     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}(mean) salario{p_end}
{p 0 48}{bind:cambio1618     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Cambio porcentual del salario (2016-2018){p_end}
{txt}{hline}
Sorted by: 
     Note: {res}Dataset has changed since last saved.
{txt}
{com}. 
. restore
{txt}
{com}. 
. describe

{txt}Contains data
 Observations:{res}             6                  ECV 2016
{txt}    Variables:{res}             4                  
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:sexo           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:sexo_lab }{bind:  }{res}{res}Sexo{p_end}
{p 0 48}{bind:ano            }{txt}{bind: int     }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Año de la encuesta{p_end}
{p 0 48}{bind:salariomed     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}(mean) salario{p_end}
{p 0 48}{bind:cambio1618     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Cambio porcentual del salario (2016-2018){p_end}
{txt}{hline}
Sorted by: {res}sexo  ano
{txt}     Note: {res}Dataset has changed since last saved.
{txt}
{com}. //_12
. global var1 "salariomed"
{txt}
{com}. 
. summarize $var1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}salariomed {c |}{res}          6    2041.687    207.3245   1833.733    2285.98
{txt}
{com}. //_13
. forvalues i=2016(1)2018{c -(}
{txt}  2{com}.   summarize salariomed if ano == `i'
{txt}  3{com}. {c )-}

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}salariomed {c |}{res}          2    2081.494    289.1874   1877.008    2285.98

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}salariomed {c |}{res}          2    2017.083     259.296   1833.733   2200.433

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}salariomed {c |}{res}          2    2026.484    243.3336   1854.421   2198.547
{txt}
{com}. //_14
. //  Abrimos una base de datos
. 
. use "ecv17.dta", clear
{txt}(ECV 2017)

{com}. 
. //  Averiguamos el frame actual
. 
. frame
{txt}  (current frame is {bf:{res:default}})

{com}. 
. //  Averiguamos qué frames tenemos disponibles
. 
. frames dir
{p2col 3 12 14 2:{txt}default }{res}34911 {txt:{it:x}} 196{txt:;} ECV 2017
{p_end}
{txt}
{com}. //_15
. //  Cambiamos el nombre al frame
. 
. frame rename default frame_ecv17
{txt}
{com}. 
. frames dir
{p2col 3 16 18 2:{txt}frame_ecv17 }{res}34911 {txt:{it:x}} 196{txt:;} ECV 2017
{p_end}
{txt}
{com}. //_16
. //  Creamos el nuevo frame vacío, que llamamos frame_ecv18
. 
. frame create frame_ecv18
{txt}
{com}. 
. //  Cambiamos al frame_ecv18
. 
. frame change frame_ecv18
{txt}
{com}. 
. //  Abrimos dentro de este frame (que está vacío) la base de datos ecv18.dta
. 
. use "ecv18.dta", clear
{txt}(ECV 2018)

{com}. 
. //  Comprobamos que ahora tenemos dos frames con datos
. 
. frames dir
{p2col 3 16 18 2:{txt}frame_ecv17 }{res}34911 {txt:{it:x}} 196{txt:;} ECV 2017
{p_end}
{p2col 3 16 18 2:{txt}frame_ecv18 }{res}33734 {txt:{it:x}} 196{txt:;} ECV 2018
{p_end}
{txt}
{com}. //_17
. //  Nos trasladamos al frame_ecv17
. 
. frame change frame_ecv17
{txt}
{com}. 
. //  Tabulamos la variable sitact, que recoge la situación de actividad de la persona
. 
. tabulate sitact

             {txt}Situación de actividad {c |}      Freq.     Percent        Cum.
{hline 36}{c +}{hline 35}
                         Trabajando {c |}{res}     13,287       38.07       38.07
{txt}                             Parado {c |}{res}      3,170        9.08       47.15
{txt}Jubilado o jubilado anticipadamente {c |}{res}      6,579       18.85       66.01
{txt}Otra clase de inactividad económica {c |}{res}     11,864       33.99      100.00
{txt}{hline 36}{c +}{hline 35}
                              Total {c |}{res}     34,900      100.00
{txt}
{com}. 
. //  Nos trasladamos al frame_ecv18
. 
. frame change frame_ecv18
{txt}
{com}. 
. //  Tabulamos la variable sitact, que recoge la situación de actividad de la persona
. 
. tabulate sitact

             {txt}Situación de actividad {c |}      Freq.     Percent        Cum.
{hline 36}{c +}{hline 35}
                         Trabajando {c |}{res}     13,021       38.60       38.60
{txt}                             Parado {c |}{res}      2,990        8.86       47.46
{txt}Jubilado o jubilado anticipadamente {c |}{res}      6,183       18.33       65.79
{txt}Otra clase de inactividad económica {c |}{res}     11,539       34.21      100.00
{txt}{hline 36}{c +}{hline 35}
                              Total {c |}{res}     33,733      100.00
{txt}
{com}. //_18
. //  Comprobamos en qué frame nos encontramos
. 
. frame
{txt}  (current frame is {bf:{res:frame_ecv18}})

{com}. 
. //  Tabulamos la variable sitact, que recoge la situación de actividad de la persona, en el frame_ecv_17
. 
. frame frame_ecv17: tabulate sitact

             {txt}Situación de actividad {c |}      Freq.     Percent        Cum.
{hline 36}{c +}{hline 35}
                         Trabajando {c |}{res}     13,287       38.07       38.07
{txt}                             Parado {c |}{res}      3,170        9.08       47.15
{txt}Jubilado o jubilado anticipadamente {c |}{res}      6,579       18.85       66.01
{txt}Otra clase de inactividad económica {c |}{res}     11,864       33.99      100.00
{txt}{hline 36}{c +}{hline 35}
                              Total {c |}{res}     34,900      100.00
{txt}
{com}. 
. //  Repetimos la operación con frame_ecv18
. 
. frame frame_ecv18: tabulate sitact

             {txt}Situación de actividad {c |}      Freq.     Percent        Cum.
{hline 36}{c +}{hline 35}
                         Trabajando {c |}{res}     13,021       38.60       38.60
{txt}                             Parado {c |}{res}      2,990        8.86       47.46
{txt}Jubilado o jubilado anticipadamente {c |}{res}      6,183       18.33       65.79
{txt}Otra clase de inactividad económica {c |}{res}     11,539       34.21      100.00
{txt}{hline 36}{c +}{hline 35}
                              Total {c |}{res}     33,733      100.00
{txt}
{com}. //_19
. //  Creamos el archivo de frames y lo guardamos en el directorio de trabajo
. 
. frame save frame_ecv1718, frames(frame_ecv17 frame_ecv18) replace
{res}{txt}file {cmd:frame_ecv1718.dtas} saved

{com}. 
. //  Vaciamos la memoria
. 
. clear
{txt}
{com}. 
. //  Lo abrimos
. 
. frame use frame_ecv1718, clear
{res}{p2col 3 16 18 2:{txt}frame_ecv17 }{res}34911 {txt:{it:x}} 196{txt:;} ECV 2017
{p_end}
{p2col 3 16 18 2:{txt}frame_ecv18 }{res}33734 {txt:{it:x}} 196{txt:;} ECV 2018
{p_end}
{txt}
{com}. 
. //  Comprobamos que contiene ambos frames
. 
. frames dir
{p2col 3 16 18 2:{txt}frame_ecv17 }{res}34911 {txt:{it:x}} 196{txt:;} ECV 2017
{p_end}
{p2col 3 16 18 2:{txt}frame_ecv18 }{res}33734 {txt:{it:x}} 196{txt:;} ECV 2018
{p_end}
{txt}
{com}. 
. //  Comprobemos en qué frame nos encontramos
. 
. frame
{txt}  (current frame is {bf:{res:frame_ecv17}})

{com}. //_20q
. quietly: cd "D:\Dropbox\curso_stata\jianton.github.io"
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\Dropbox\curso_stata\jianton.github.io\stata2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Jun 2025, 22:33:44
{txt}{.-}
{smcl}
{txt}{sf}{ul off}